In [36]:
import numpy as np
import pandas as pd

### Q1.

In [37]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], 
               index=['서울','부산','인천','대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [38]:
s1 = pd.Series([9904312, 3448737, 2890451, 1490158], 
                index=['서울','부산','인천','대전'])
s1

서울    9904312
부산    3448737
인천    2890451
대전    1490158
dtype: int64

In [39]:
s + 1000

서울    9905312
부산    3449737
인천    2891451
대구    2467052
dtype: int64

In [40]:
s - 100

서울    9904212
부산    3448637
인천    2890351
대구    2465952
dtype: int64

In [41]:
s1 * 3

서울    29712936
부산    10346211
인천     8671353
대전     4470474
dtype: int64

In [42]:
s1 / 2

서울    4952156.0
부산    1724368.5
인천    1445225.5
대전     745079.0
dtype: float64

### Q2.

In [43]:
data = { 
    '2020': [9831482, 3693191, 2632035, 2531774, 1838290], 
    '2015': [9762514, 3526890, 2517847, 2456072, 1781389], 
    '2010': [9853711, 3655437, 2466339, 2473990, 1620465], 
    '지역': ['수도권', '경상권', '수도권', '경상권', '수도권'], 
    '2015-2020 증가율': [0.7, 4.7, 4.5, 3.1, 3.2]
}
columns = ['지역', '2020', '2015', '2010', '2015-2020 증가율']
index = ['서울', '부산', '인천', '대구', '과천']
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2020     2015     2010  2015-2020 증가율
서울  수도권  9831482  9762514  9853711            0.7
부산  경상권  3693191  3526890  3655437            4.7
인천  수도권  2632035  2517847  2466339            4.5
대구  경상권  2531774  2456072  2473990            3.1
과천  수도권  1838290  1781389  1620465            3.2

### Q3.

In [44]:
data = {
    '국어': [80, 90, 70, 30],
    '영어': [90, 70, 60, 40], 
    '수학': [90, 60, 80, 70]
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [45]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [46]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [60]:
np.mean(df.values, axis = 1)

array([86.6675, 73.3325, 70.    , 46.6675])

In [48]:
df.mean(axis = 1)

춘향    86.666667
몽룡    73.333333
향단    70.000000
방자    46.666667
dtype: float64

In [49]:
df['평균'] = ((df.mean(axis=1)).round(2))
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [62]:
df['평균2'] = np.mean(df.values[:,:-1], axis=1).round(2)
df

    국어  영어  수학     평균    평균2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  40  70  46.67  46.67

In [63]:
df.drop(columns=['평균','평균2'], inplace=True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [64]:
df['영어']['방자'] = 80
df['평균'] = ((df.mean(axis=1)).round(2))
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [53]:
data = {
    '국어': [80, 90, 70, 30],
    '영어': [90, 70, 60, 40], 
    '수학': [90, 60, 80, 70]
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df1 = pd.DataFrame(data, index=index, columns=columns).copy()
df1

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [56]:
df1['평균'] = ((df.mean(axis=1)).round(2)).copy()
df1

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [57]:
df1['영어']['방자'] = 80
# 이 값을 바꿈으로써 평균에 영향을 주기 때문에 warning 문구가 뜸

#warning 문구 없애기
#import warnings
# warnings.filterwarnings('ignore')

<ipython-input-57-ef26bd2338bb>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['영어']['방자'] = 80

In [58]:
df1

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [65]:
df.head(1)

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [67]:
df.head(3).tail(1)

    국어  영어  수학    평균
향단  70  60  80  70.0

In [68]:
df.T

       춘향     몽룡    향단    방자
국어  80.00  90.00  70.0  30.0
영어  90.00  70.00  60.0  80.0
수학  90.00  60.00  80.0  70.0
평균  86.67  73.33  70.0  60.0

In [71]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [73]:
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [75]:
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [74]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### Q4.

In [77]:
df = pd.DataFrame(np.arange(25).reshape(5,5), columns=list('ABCDE'), index=list('vwxyz'))
df

    A   B   C   D   E
v   0   1   2   3   4
w   5   6   7   8   9
x  10  11  12  13  14
y  15  16  17  18  19
z  20  21  22  23  24

In [81]:
df['C']['x'], df['C'][2], df.C['x'], df.C[2], df.C.x

(12, 12, 12, 12, 12)

In [79]:
# loc indexer
df.loc['x','C'], df.loc['x'][2], df.loc['x']['C']

(12, 12, 12)

In [80]:
# iloc indexer
df.iloc[2,2], df.iloc[2]['C'], df.iloc[2][2]

(12, 12, 12)